In [1]:
import pandas as pd
import numpy as np

In [58]:
dt={'name':['smith','jhon','tom','micky',np.nan,'fizz','ricky'],'age':[25,26,np.nan,23,30,29,np.nan],
    'rating':['?',3.24,3.98,2.56,3.20,4.60,3.80]}

In [4]:
df=pd.DataFrame(dt)

In [5]:
df

    name   age  rating
0  smith  25.0    4.23
1   jhon  26.0    3.24
2    tom   NaN    3.98
3  micky  23.0    2.56
4    NaN  30.0    3.20
5   fizz  29.0    4.60
6  ricky   NaN    3.80

In [6]:
# Nan - Not a number (missing value or null)

In [10]:
# isnull - isnull fun returns a boolean value (True or false)
df.isnull().sum()

name      1
age       2
rating    0
dtype: int64

### how can we handle this null values ?

In [ ]:
# drop(drop_col,asix,inplace) or dropna

In [11]:
# handling missing values

# 1. Detect number of missing values in each column  --> isnull().sum()
# 2. Handle them using 3 techniques
        # i) delete entire column  -- drop()
        # ii) impute / fill null values with another value --- fillna()
        # iii) remove null records  --> dropna()
# 3. replace

In [22]:
df.drop('rating',axis='columns',inplace = True)

In [23]:
df

    name   age
0  smith  25.0
1   jhon  26.0
2    tom   NaN
3  micky  23.0
4    NaN  30.0
5   fizz  29.0
6  ricky   NaN

### syntax : DataFrame.drop(column_name,axis=,inplace=)

- **column_name** - Here you can pass the single columns name or List of columns that you want to drop.
- **axis** - you can pass axis=1 for columns or axis ='columns'
- **inplace** - take boolen values True or False and is used for make change in existing dataframe

In [24]:
df.drop(columns=['name','age'],axis='columns',inplace = True)

In [25]:
df

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [59]:
df1=pd.DataFrame(dt)

In [27]:
df1

    name   age  rating
0  smith  25.0    4.23
1   jhon  26.0    3.24
2    tom   NaN    3.98
3  micky  23.0    2.56
4    NaN  30.0    3.20
5   fizz  29.0    4.60
6  ricky   NaN    3.80

In [29]:
age_mean=df1['age'].mean()

In [32]:
df1['age'].fillna(age_mean,inplace=True)

In [33]:
df1

    name   age  rating
0  smith  25.0    4.23
1   jhon  26.0    3.24
2    tom  26.6    3.98
3  micky  23.0    2.56
4    NaN  30.0    3.20
5   fizz  29.0    4.60
6  ricky  26.6    3.80

In [36]:
df1.dropna(inplace=True)

In [37]:
df1

    name   age  rating
0  smith  25.0    4.23
1   jhon  26.0    3.24
2    tom  26.6    3.98
3  micky  23.0    2.56
5   fizz  29.0    4.60
6  ricky  26.6    3.80

In [ ]:
smith,
,john

In [42]:
df1['name'].replace('ricky','tang')

0      max
1     jhon
2      tom
3    micky
5     fizz
6     tang
Name: name, dtype: object

In [43]:
df1

    name   age  rating
0    max  25.0    4.23
1   jhon  26.0    3.24
2    tom  26.6    3.98
3  micky  23.0    2.56
5   fizz  29.0    4.60
6  ricky  26.6    3.80

In [44]:
df1['name'] = df1['name'].replace('ricky','tang')

In [45]:
df1

    name   age  rating
0    max  25.0    4.23
1   jhon  26.0    3.24
2    tom  26.6    3.98
3  micky  23.0    2.56
5   fizz  29.0    4.60
6   tang  26.6    3.80

In [60]:
df1

    name   age rating
0  smith  25.0      ?
1   jhon  26.0   3.24
2    tom   NaN   3.98
3  micky  23.0   2.56
4    NaN  30.0    3.2
5   fizz  29.0    4.6
6  ricky   NaN    3.8

In [61]:
df1['rating'].dtype

dtype('O')

In [68]:
df1['rating'].replace('',np.nan,inplace=True)

In [69]:
df1

    name   age  rating
0  smith  25.0     NaN
1   jhon  26.0    3.24
2    tom   NaN    3.98
3  micky  23.0    2.56
4    NaN  30.0    3.20
5   fizz  29.0    4.60
6  ricky   NaN    3.80

In [70]:
df1['rating'].dtype

dtype('float64')

In [71]:
df1['rating'].mean()

3.563333333333333

In [72]:
df1['rating'].fillna(df1['rating'].mean())

0    3.563333
1    3.240000
2    3.980000
3    2.560000
4    3.200000
5    4.600000
6    3.800000
Name: rating, dtype: float64

In [76]:
df1['rating']=df1['rating'].astype(object)

In [78]:
df1['rating'].dtype

dtype('O')

In [79]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     5 non-null      float64
 2   rating  6 non-null      object
dtypes: float64(1), object(2)
memory usage: 300.0+ bytes

In [81]:
df1['rating'].astype(float)

0     NaN
1    3.24
2    3.98
3    2.56
4    3.20
5    4.60
6    3.80
Name: rating, dtype: float64

In [85]:
df=pd.read_csv('course.csv')

In [86]:
df

     1     Mumbai        PQR institute .Pvt            BI  MH   9 Months
0    2      Delhi    ABC institute .Pvt.LTD            AI  UP  18 Months
1    3  Bengaluru       MNO  institute .Ltd  Data Science  TN  11 Months
2    4     Bhopal   RST  institute .Pvt.LTD            ML  MP   3 Months
3    5     Mumbai   EFG  institute .Pvt.LTD            DL  MH   3 Months
4    6  Hyderabad           LMN  institute          Could  AP   4 Months
5    7      Patna      DEF   institute .Ltd      Web Serv  BH   4 Months
6    8    Channai   PQR  institute .Pvt.LTD           AWS  KT   3 Months
7    9    Kolkata       UVW  institute .Ltd    Networking  WB   3 Months
8   10  Hyderabad      GHI   institute .Ltd            AI  AP  18 Months
9   11     Bhopal          IJK   institute             DL  MP   3 Months
10  12       Pune      KLM   institute .Ltd  Data Science  MH  11 Months
11  13      Delhi       STU  institute .Ltd            BI  UP   6 Months
12  14     Mumbai   XYZ  institute .Pvt.LTD         Could  MH   3 Months
13  15      Patna       NOP  institute .Ltd           AWS  BH   3 Months
14  16      Surat       QRS  institute .Ltd            ML  GJ   3 Months
15  17      Delhi           WXY  institute            AWS  UP   3 Months
16  18     Mumbai          ZAB   institute       Web Serv  MH   4 Months
17  19       Pune       CDE  institute .Ltd  Data Science  MH  11 Months
18  20  Bengaluru   JKL  institute .Pvt.LTD            AI  TN  18 Months
19  21      Surat           INS   institute  Data Science  Gj  11 Months
20  22  Hyderabad       ZAP  institute .Ltd            ML  AP   3 Months
21  23     Mumbai  XCAD  institute .Pvt.LTD            DL  MH   3 Months
22  24    Channai          MTK   institute          Could  KT   4 Months
23  25      Patna       BST  institute .Ltd      Web Serv  BH   4 Months